/*
! Завдання №1: 
З клавіатури вводяться імена двох дітей та кількість у них цукерок. 
Вивести не екран ім’я тієї дитини, у якої кількість цукерок є більшою, або вивести, 
що кількість однакова.
*/

/*
перша дитина
друга дитина 

n кол-во цукерок у першої дитини
n кол-во цукерок у другої дитини

порівняти кількість цукерок і показати у кого більше цукерок або якщо порівну
*/

const child1 = prompt("Введіть ім'я першої дитини:");
const candy1 = parseInt(prompt("Введіть кількість цукерок першої дитини:"));

const child2 = prompt("Введіть ім'я другої дитини:");
const candy2 = parseInt(prompt("Введіть кількість цукерок другої дитини:"));


// Порівняння кількості цукерок та виведення результату

if (candy1 > candy2) {
    document.write(child1 + " має більше цукерок, ніж " + child2 + ".");
} else if (candy1 < candy2) {
    document.write(child2 + " має більше цукерок, ніж " + child1 + ".");
} else {
    document.write("У " + child1 + " та " + child2 + " однакова кількість цукерок.");
}